import 'package:bus/model/locate_model.dart';

List<Locate> locates = [
  Locate(lat: "24.841245", lon: "120.995698"),

  /// "新竹縣"
  Locate(lat: "24.434365", lon: "118.312425"),

  /// "金門縣"
  Locate(lat: "24.563327", lon: "120.81097"),

  /// "苗栗縣"
  Locate(lat: "25.01154", lon: "121.450888"),

  /// "新北市"
  Locate(lat: "24.753707", lon: "121.745083"),

  /// "宜蘭縣"
  Locate(lat: "23.698834", lon: "120.518874"),

  /// "雲林縣"
  Locate(lat: "22.996394", lon: "120.160419"),

  /// "臺南市"
  Locate(lat: "22.623511", lon: "120.304085"),

  /// "高雄市"
  Locate(lat: "24.082575", lon: "120.534059"),

  /// "彰化縣"
  Locate(lat: "25.035095", lon: "121.558742"),

  /// "臺北市"
  Locate(lat: "23.913301", lon: "120.679244"),

  /// "南投縣"
  Locate(lat: "23.567554", lon: "119.570666"),

  /// "澎湖縣"
  Locate(lat: "25.153191", lon: "121.759355"),

  /// "基隆市"
  Locate(lat: "24.99572", lon: "121.293452"),

  /// "桃園市"
  Locate(lat: "23.983897", lon: "121.598641"),

  /// "花蓮縣"
  Locate(lat: "26.154204", lon: "119.929303"),

  /// "連江縣"
  Locate(lat: "22.756487", lon: "121.138672"),

  /// "臺東縣"
  Locate(lat: "23.480384", lon: "120.445361"),

  /// "嘉義市"
  Locate(lat: "23.460227", lon: "120.323988"),

  /// "嘉義縣"
  Locate(lat: "22.664236", lon: "120.483389"),

  /// "屏東縣"
  Locate(lat: "24.142918", lon: "120.66295"),

  /// "臺中市"
  Locate(lat: "24.818109", lon: "120.96211"),

  /// "新竹市"
];

List<String> cities = [
  "新竹縣",
  "金門縣",
  "苗栗縣",
  "新北市",
  "宜蘭縣",
  "雲林縣",
  "臺南市",
  "高雄市",
  "彰化縣",
  "臺北市",
  "南投縣",
  "澎湖縣",
  "基隆市",
  "桃園市",
  "花蓮縣",
  "連江縣",
  "臺東縣",
  "嘉義市",
  "嘉義縣",
  "屏東縣",
  "臺中市",
  "新竹市",
];
